davidgoddard/mower2026/external-hardware/esp32/motor-controller/motor-controller.ino
  int targetSign = motor.requestedPwmPercent >= 0 ? 1 : -1;
  int targetMagnitude = abs(motor.requestedPwmPercent);
  int currentMagnitude = abs(motor.appliedPwmPercent);
  float activeRate = (targetMagnitude > currentMagnitude) ? accelRatePercentPerSecond : decelRatePercentPerSecond;
  int maxStep = stepFromRate(activeRate, elapsedMs);

  if (motor.appliedPwmPercent != 0 && motor.currentDirectionSign != targetSign && targetMagnitude > 0) {
    int reduced = currentMagnitude - maxStep;
    if (reduced < 0) reduced = 0;
    motor.appliedPwmPercent = clampPercent(motor.currentDirectionSign * reduced);
    if (reduced == 0) {
      motor.currentDirectionSign = targetSign;
    }
    applyMotorHardware(motor);
    return;
  }

  int desiredSignedPercent = targetMagnitude == 0 ? 0 : targetSign * targetMagnitude;
  if (motor.appliedPwmPercent < desiredSignedPercent) {
    motor.appliedPwmPercent = clampPercent(motor.appliedPwmPercent + maxStep);
  } else if (motor.appliedPwmPercent > desiredSignedPercent) {
    motor.appliedPwmPercent = clampPercent(motor.appliedPwmPercent - maxStep);
  }

  int minimumMovingPwmPercent = max(
    1,
    static_cast<int>(DEFAULT_MIN_EFFECTIVE_WHEEL_OUTPUT_PERCENT * 100.0f)
  );
  int appliedMagnitude = abs(motor.appliedPwmPercent);
  bool effectiveMoveRequested = targetMagnitude > 0
    && fabs(motor.rampedTargetPercent) >= DEFAULT_MIN_EFFECTIVE_WHEEL_OUTPUT_PERCENT;
  if (effectiveMoveRequested && appliedMagnitude > 0 && appliedMagnitude < minimumMovingPwmPercent) {
    motor.appliedPwmPercent = clampPercent(targetSign * minimumMovingPwmPercent);
  } else if (targetMagnitude == 0 && appliedMagnitude < minimumMovingPwmPercent) {
    motor.appliedPwmPercent = 0;
  }

  if (motor.appliedPwmPercent > 0) {
    motor.currentDirectionSign = 1;
  } else if (motor.appliedPwmPercent < 0) {
    motor.currentDirectionSign = -1;
  }
  // When the applied PWM falls to zero we deliberately keep the last
  // non-zero direction sign. The DIR pin stays reflecting the direction
  // the wheel was last driven, so the encoder ISR signs coast pulses
  // correctly while the wheel rolls to a stop.
  applyMotorHardware(motor);
}

// Returns the per-tick step size (% units) for a given rate and elapsed time.
// rate is in %/s; elapsedMs is in ms.
// Example: rate=250, elapsed=10 → step=2.5 → truncates to 2 per tick.
inline int stepFromRate(float ratePercentPerSecond, uint32_t elapsedMs) {
  return max(1, static_cast<int>(ratePercentPerSecond * static_cast<float>(elapsedMs) / 1000.0f));
}

// ===== Control / feedback =====
float adcCountToVolts(int rawCount) {
  return (static_cast<float>(rawCount) / static_cast<float>(ADC_MAX_COUNT)) * CURRENT_SENSOR_SUPPLY_VOLTS;
}

void calibrateCurrentSensors() {
  uint32_t leftAccumulator = 0;
  uint32_t rightAccumulator = 0;
  for (uint16_t index = 0; index < CURRENT_SENSOR_CALIBRATION_SAMPLES; index += 1) {
    leftAccumulator += static_cast<uint32_t>(analogRead(g_leftCurrentSensor.pin));
    rightAccumulator += static_cast<uint32_t>(analogRead(g_rightCurrentSensor.pin));
    delay(2);
  }

  g_leftCurrentSensor.zeroVoltageVolts = adcCountToVolts(static_cast<int>(leftAccumulator / CURRENT_SENSOR_CALIBRATION_SAMPLES));
  g_rightCurrentSensor.zeroVoltageVolts = adcCountToVolts(static_cast<int>(rightAccumulator / CURRENT_SENSOR_CALIBRATION_SAMPLES));
  g_leftCurrentSensor.filteredCurrentAmps = 0.0f;
  g_rightCurrentSensor.filteredCurrentAmps = 0.0f;
  g_currentSensorsCalibrated = true;
}

float readCurrentSensor(CurrentSensorState &sensor) {
  if (!g_currentSensorsCalibrated) {
    return 0.0f;
  }
  const int rawCount = analogRead(sensor.pin);
  const float measuredVolts = adcCountToVolts(rawCount);
  const float signedCurrentAmps = (measuredVolts - sensor.zeroVoltageVolts) / CURRENT_SENSOR_VOLTS_PER_AMP;
  const float currentMagnitudeAmps = fabs(signedCurrentAmps);

  sensor.filteredCurrentAmps = (sensor.filteredCurrentAmps * (1.0f - CURRENT_SENSOR_FILTER_ALPHA))
    + (currentMagnitudeAmps * CURRENT_SENSOR_FILTER_ALPHA);
  return sensor.filteredCurrentAmps;
}

void refreshFeedbackSnapshot(uint32_t nowMillis) {
  static uint32_t lastSnapshotMillis = 0;
  uint32_t elapsedMs = nowMillis - lastSnapshotMillis;
  if (elapsedMs == 0) {
    elapsedMs = FEEDBACK_PERIOD_MS;
  }
  lastSnapshotMillis = nowMillis;

  // The encoder ISRs already sign each pulse by the live DIR-pin level, so
  // the accumulator is the signed pulse delta over this feedback window —
  // including coast pulses during brake-to-stop and ramp-down, which used
  // to be discarded by an unwanted "is the motor driven right now?" gate.
  int32_t signedLeftPulses = 0;
  int32_t signedRightPulses = 0;
  noInterrupts();
  signedLeftPulses = g_leftPulseAccumulator;
  signedRightPulses = g_rightPulseAccumulator;
  g_leftPulseAccumulator = 0;
  g_rightPulseAccumulator = 0;
  interrupts();

  g_latestFeedback.timestampMillis = nowMillis;
  g_latestFeedback.leftEncoderDelta = signedLeftPulses;
  g_latestFeedback.rightEncoderDelta = signedRightPulses;
  g_latestFeedback.leftPwmAppliedPercent = g_leftMotor.appliedPwmPercent;
  g_latestFeedback.rightPwmAppliedPercent = g_rightMotor.appliedPwmPercent;
  g_latestFeedback.leftMotorCurrentAmps = readCurrentSensor(g_leftCurrentSensor);
  g_latestFeedback.rightMotorCurrentAmps = readCurrentSensor(g_rightCurrentSensor);
  g_latestFeedback.faultFlags = g_commandLeaseHealthy ? 0 : MOTOR_FAULT_COMMAND_TIMEOUT;
  g_latestFeedback.watchdogHealthy = g_commandLeaseHealthy;

  uint8_t payload[MOTOR_FEEDBACK_PAYLOAD_SIZE];
  encodeMotorFeedbackPayload(g_latestFeedback, payload);

  const uint8_t inactiveIndex = static_cast<uint8_t>(1u - g_activeTxFrameIndex);
  encodeFrame(
    MESSAGE_TYPE_MOTOR_FEEDBACK,
    g_feedbackSequence,
    g_latestFeedback.faultFlags == 0 ? 0 : 0x01,
    payload,
    MOTOR_FEEDBACK_PAYLOAD_SIZE,
    g_txFrames[inactiveIndex]
  );
  g_feedbackSequence = static_cast<uint16_t>(g_feedbackSequence + 1u);
  g_activeTxFrameIndex = inactiveIndex;
}

